<template>
   <div>
    <div class="protocol">
    <p>本协议是上海冰创信息科技有限公司（以下简称“本公司”）与服务使用人（以下简称“您”或“用户”）就您使用朝阳爱理财服务相关操作的有关事项所订立的有效合约。您通过网络页面点击确认或以其他方式选择接受本协议，即表示您与本公司已达成协议并同意接受本协议的全部约定内容以及与本协议有关的已经发布或将来可能发布的各项规则、页面提示、操作流程、公告或通知（以下统称“朝阳爱理财平台规则”）。</p>
    <p>在接受本协议之前，请您仔细阅读本协议的全部内容。如果您不同意本协议的任意内容，或者无法准确理解本公司对条款的解释，请不要进行后续操作。一旦您使用朝阳爱理财服务，即表示您同意遵循朝阳爱理财平台规则。</p>
    <h2>第一条 服务内容</h2>
    <p>朝阳爱理财平台的所有权和运营权归本公司所有。朝阳爱理财服务是本公司根据实际情况为您提供的新闻资讯、论坛、评论、金融产品行情等服务，具体服务以本公司实际提供为准。</p>
    <h2>第二条 服务协议变更</h2>
    <p>本公司有权在必要时通过在网页上发出公告等合理方式修改本服务协议以及各单项服务的相关协议。用户在享受各项服务时，应当及时查阅了解修改的内容，并自觉遵守本服务协议以及该单项服务的相关协议。</p>
    <p>用户如继续使用本服务协议涉及的服务，则视为对修改内容的同意。用户在不同意修改内容的情况下，有权停止使用本服务协议涉及的服务。</p>
    <h2>第三条 服务变更、中断或终止</h2>
    <p>鉴于互联网服务的特殊性（包括但不限于服务器的稳定性问题、恶意的网络攻击等行为的存在及其他本公司无法控制的情形），用户同意本公司有权随时中断或终止部分或全部的服务（包括收费网络服务），若发生该等中断或中止服务的情形，本公司将尽可能及时通过网页公告、系统通知、私信、短信提醒或其他合理方式通知受到影响的用户，但本公司不对是否发出通知或通知是否送达承担任何义务，并且本公司不承担任何责任。</p>
    <h2>第四条 用户资料合法性和真实性</h2>
    <p>为使用朝阳爱理财服务，用户同意：</p>
    <p>1. 提供及时、详尽及准确的个人资料（包括但不限于姓名、性别、身份证号等，具体以朝阳爱理财平台规则为准）。</p>
    <p>2. 不断更新自己的注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。</p>
    <p>3. 不冒用他人资料（包括不限于姓名、图片、公司机构名称、昵称等）。</p>
    <p>如果用户提供的资料不准确，不真实，不合法有效，或者冒用他人资料，本公司保留直接修改资料或者结束用户使用各项服务的权利。用户同意，用户提供的准确的个人资料系作为认定用户与帐号的关联性以及用户身份的唯一证据，并同意本公司可以在朝阳爱理财的其他服务场景里运用用户的该等个人资料。用户在使用朝阳爱理财服务的同时，同意接受本公司提供的相关信息服务,包括但不限于短信、邮件等。</p>
    <h2>第五条 隐私保护</h2>
    <p>保护用户隐私是本公司的基本政策，非经用户许可，本公司不对外公开或向第三方提供单个用户的注册资料及用户存储在朝阳爱理财服务的非公开内容，但下列情况除外：</p>
    <p>1. 遵守有关法律、法规的规定，包括在国家有关机关查询时，提供用户的注册信息、用户在朝阳爱理财上发布的信息内容及其发布时间、互联网地址或者域名；</p>
    <p>2. 因用户使用快捷登陆等服务需要向第三方提供相关内容的；</p>
    <p>3. 维护朝阳爱理财的知识产权或其他重要权利；</p>
    <p>4. 在紧急情况下竭力维护用户个人和社会大众的隐私安全；</p>
    <p>5. 根据本协议相关规定或者本公司认为必要的其他情况。</p>
    <h2>第六条 免责声明</h2>
    <p>1. 用户在使用朝阳爱理财服务的过程中应遵守国家法律法规及政策规定，因其使用朝阳爱理财服务而产生的行为后果由用户自行承担,本公司不承担任何责任。</p>
    <p>2. 朝阳爱理财所提供的任何信息（包括但不限于朝阳爱理财官方提供的、朝阳爱理财用户发布的、朝阳爱理财邀请的嘉宾提供的），本公司并不能保证其完全实时或完全准确，也不表明本公司证实其描述或赞同其观点。所有内容仅供参考，不构成投资建议或者其他实际的操作意见，用户据此操作所造成的后果自行负责。</p>
    <p>3. 本公司不保证服务一定能满足用户的要求，也不保证服务不会中断，对服务的及时性、安全性、准确性也都不作保证。对于各种原因造成的网络服务中断、资料丢失、数据损毁或其他缺陷，本公司不承担任何责任。</p>
    <p>4. 对于所有的用户注册资料、姓名、身份、发言内容以及其他行为，用户应自行承担相应责任，本公司不承担任何责任。</p>
    <p>5. 用户知晓并且同意，对于本公司因为计算机系统、网络安全等问题，而导致用户资料意外泄漏，本公司并不对此负责。除非用户能证明，该泄漏是由于本公司的故意行为。</p>
    <h2>第七条 知识产权</h2>
    <p>1. 内容的定义包括：文字、软件、声音、相片、视频、图表等。</p>
    <p>2. 用户同意，其发布上传到本公司旗下朝阳爱理财的任何内容，本公司获得其全世界范围内免费的、永久性的、不可撤销的、非独家的使用权和转授权的权利。本公司有权将内容用于其他合法用途，包括但不限于部分或者全部地复制、修改、改编、翻译、组装、分拆、推广、分发、广播、表演、演绎、出版。若因使用该等内容侵权，相关责任由用户承担，本公司不承担任何责任。</p>
    <h2>第八条 用户责任和义务</h2>
    <p>用户独立承担其发布内容相关的所有责任。用户对朝阳爱理财服务的使用必须遵守所有适用于服务的地方法律、国家法律和国际法律。用户已经知晓并且承诺：</p>
    <p>1. 用户在朝阳爱理财的网页上发布信息或者利用朝阳爱理财的服务时必须符合中国有关法律法规，不得在朝阳爱理财的网页上或者利用朝阳爱理财的服务制作、复制、发布、传播以下信息：</p>
    <p>1) 违反宪法确定的基本原则的；</p>
    <p>2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
    <p>3) 损害国家荣誉和利益的；</p>
    <p>4) 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
    <p>5) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
    <p>6) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
    <p>7) 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</p>
    <p>8) 侮辱或者诽谤他人，侵害他人合法权益的；</p>
    <p>9) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；</p>
    <p>10) 以非法民间组织名义活动的；</p>
    <p>11) 含有法律、行政法规禁止的其他内容的。</p>
    <p>2. 用户在朝阳爱理财的网页上发布信息或者利用朝阳爱理财服务时还必须符合其他有关国家和地区的法律规定以及国际法的有关规定。</p>
    <p>3. 用户发表在朝阳爱理财上的任何内容，本公司可以根据自己标准和立场进行管理或者删除，而无需提前或者事后向用户说明；管理或者删除的标准，也完全由本公司独立制订，无需征求用户意见，也无需向用户公开。</p>
    <p>4. 用户不得以任何方式干扰朝阳爱理财服务。</p>
    <p>5. 用户应遵守朝阳爱理财平台规则。</p>
    <p>6. 用户须对自己在使用朝阳爱理财服务过程中的行为承担法律责任。用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在本公司首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应及时给予本公司相应的赔偿。</p>
    <p>7. 用户理解，如果本公司发现其网站传输的信息明显属于上段第1条所列内容之一，依据中国法律，本公司有义务立即停止传输，保存有关记录，向国家有关机关报告，并且删除含有该内容的地址、目录或关闭服务器。</p>
    <p>8. 用户使用朝阳爱理财电子公告服务，包括电子布告牌、电子白板、电子论坛、网络聊天室和留言板等以交互形式为上网用户提供信息发布条件的行为，也须遵守本条的规定。若用户的行为不符合以上提到的服务协议，本公司将作出独立判断立即取消用户服务帐号或者其他有必要的措施。</p>
    <h2>第九条 帐号的有效期限</h2>
    <p>用户在朝阳爱理财注册的帐号，如果连续超过3个月没有登录，本公司有权删除用户的帐号，而无需另行通知。</p>
    <h2>第十条 通知和送达</h2>
    <p>用户知晓并且同意，朝阳爱理财的各类通知，通过网页公告、系统通知、官方管理帐号通知（公开或者私下）、电子邮件或者常规信件进行，通知发出时，即被视为已送达收件人。用户对本公司的通知，需要通过本公司正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。</p>
    <h2>第十一条 适用法律和管辖权</h2>
    <p>本协议适用中华人民共和国的法律，并且排除一切冲突法规定的适用。如出现纠纷，用户和本公司一致同意将纠纷交由本公司所在地法院管辖。</p>
    <h2>第十二条 解释权</h2>
    <p>在法律允许的最大范围内，本公司保留对本服务协议的最终解释权。</p>
</div>   
   </div> 
</template>
<script>
export default {
    name:"protocol",
    data(){
        return{}
    },
    mounted(){
    let that = this
    document.addEventListener('message', function (e) {
        if (window.originalPostMessage) { 
          window.postMessage(JSON.stringify({goBack: 'next'}));
        } else {
          throw Error('none');
        }
    });
  },
  methods:{
       message ( e ) {
            let that = this
            document.addEventListener('message', function (e) {
               this.$router.push({path:'/Noviceguide'})
               that.sendData()
            });
        },
        sendData ( ) {
            if (window.originalPostMessage) { 
                window.postMessage('next');
            } else {
                throw Error('none');
            }
        },
   }
}
</script>
<style>
 *{
        margin: 0;
        padding: 0;
        background: #f9f9f9;
    }
    .protocol {
        margin-top: 10px;
        padding-left: 16px #f1f1f1;
        padding-right: 18px #f1f1f1;
        border-top: 1px solid #f1f1f1;
        background: #fff;
        font-family: '微软雅黑';
    }
    h1 {
        line-height: 49px;
        margin-bottom: 16px;
        text-align: center;
        font-size: 16px;
    }
    p, h2 {
        font-size: 28px;
    }
    h2 {
        line-height: 86px;
    }
    p {
        text-indent: 2em;
        color: #9b9b9b;
        line-height: 44px;
    }
</style>
